## Series

### Creating Series from a list

In [1]:
#Import Pandas as it is the main library
import pandas as pd
#Import NumPy while working with ndarrays 
import numpy as np

In [2]:
#install pandas and numpy if not installed
#!pip3 install pandas

In [3]:
#creating series from a list
first_series = pd.Series(list('ICFOSS'))

In [4]:
#print first_series
print(first_series)

0    I
1    C
2    F
3    O
4    S
5    S
dtype: object

In [5]:
my_list = [22,25,28,30,35]

In [6]:
pd.Series(my_list)

0    22
1    25
2    28
3    30
4    35
dtype: int64

In [7]:
labels = ['a','b','c','d','e']

In [8]:
pd.Series(data = my_list,index = labels)

a    22
b    25
c    28
d    30
e    35
dtype: int64

In [9]:
pd.Series(my_list, labels)

a    22
b    25
c    28
d    30
e    35
dtype: int64

### Creating Series from an ndarray

In [10]:
arr = np.array([22,25,28,30,35])

In [11]:
pd.Series(arr)

0    22
1    25
2    28
3    30
4    35
dtype: int64

In [12]:
pd.Series(arr, labels)

a    22
b    25
c    28
d    30
e    35
dtype: int64

### Creating Series from dict

In [13]:
dic = {'a':22,'b':25,'c':28,'d':30,'e':35}

In [14]:
series_dic = pd.Series(dic)
print(series_dic)

a    22
b    25
c    28
d    30
e    35
dtype: int64

### Creating Series from Scalar

In [15]:
#print series with scalar inputs
scalar_series = pd.Series(25, index=['a','b','c','d','e'])

In [16]:
print(scalar_series)

a    25
b    25
c    25
d    25
e    25
dtype: int64

### Access elements in series

In [17]:
series_dic[0]

22

In [18]:
series_dic[0:3]

a    22
b    25
c    28
dtype: int64

In [19]:
series_dic.loc['a']

22

In [20]:
series_dic.iloc[3]

30

### Vectorizing Operations in Series

In [21]:
series1 = pd.Series([22,25,28,30,35], index = ['a','b','c','d','e'])
series2 = pd.Series([28,30,26,32,30],index= ['a','b','c','d','e'])

In [22]:
series1 + series2

a    50
b    55
c    54
d    62
e    65
dtype: int64

In [23]:
series3 = pd.Series([30,31,32,33,34,35,36], index = ['a','b','c','d','f','g','h'])

In [24]:
series1 +series1+series3

a    74.0
b    81.0
c    88.0
d    93.0
e     NaN
f     NaN
g     NaN
h     NaN
dtype: float64

## Data Frame

### Creating DataFrame from Lists

In [25]:
import pandas as pd
import numpy as np

In [26]:
student_details = {'Name':['Deepu', 'Jaison', 'Sudheesh'], 
                   'District':['Kozhikode','Ernakulam', 'Idukki'],
                   'marks': ['35','36','37']}

In [27]:
df_student_details = pd.DataFrame(student_details)

In [28]:
df_student_details

       Name   District marks
0     Deepu  Kozhikode    35
1    Jaison  Ernakulam    36
2  Sudheesh     Idukki    37

### Creating DataFrame from dict

In [29]:
student_details = {'Total_trainings':{2016:30, 2017:35, 2018:40},
                   ' Students_impacted':{2016:800,2017:1300,2018:2000}}

In [30]:
df_student_dict = pd.DataFrame(student_details)

In [31]:
df_student_dict

      Total_trainings   Students_impacted
2016               30                 800
2017               35                1300
2018               40                2000

### Viewing DataFrame

#### You can view a DataFrame by referring to the column name or with the describe function.

In [32]:
#Select by total trainings
df_student_dict.Total_trainings

2016    30
2017    35
2018    40
Name: Total_trainings, dtype: int64

In [33]:
# Use describe function to view the contenta
df_student_dict.describe

<bound method NDFrame.describe of       Total_trainings   Students_impacted
2016               30                 800
2017               35                1300
2018               40                2000>

### Missing Values

#### Handling Missing Values

In [34]:
import pandas as pd

In [35]:
#declare first and second series
first_series =  pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
second_series = pd.Series([10,20,30,40,50], index = ['c','e','f','g','h'])

In [36]:
sum_of_series = first_series + second_series

In [37]:
sum_of_series

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

In [38]:
# The dropna function drops all the values with uncommon indices.
# drop NaN(not a number) values from dataset
dropna_s = sum_of_series.dropna()

In [39]:
dropna_s

c    13.0
e    25.0
dtype: float64

In [40]:
#fill the missing values with zero
fillna_s = sum_of_series.fillna(0)

In [41]:
fillna_s

a     0.0
b     0.0
c    13.0
d     0.0
e    25.0
f     0.0
g     0.0
h     0.0
dtype: float64

## Data Operation

### Data operation can be performed through various built-in methods for faster data processing.

In [42]:

import pandas as pd

In [43]:
#Declare the scores for mathematics and Chemistry
df_scores = pd.DataFrame({'Mathematics': [30,31,32,33,34],
                          'Chemistry': [33,32,31,30,29]},
                         index = ['depu', 'jaison', 'sudeesh', 'shafeek', 'ajmi'] )

In [44]:
df_scores

         Mathematics  Chemistry
depu              30         33
jaison            31         32
sudeesh           32         31
shafeek           33         30
ajmi              34         29

### Data Operation with Functions

In [45]:
#Declare a custom function
def mark_list(scores):
    if scores == 34:
        return 'A'
    if scores == 33:
        return 'B'
    if scores == 32:
        return 'C'
    if scores == 31:
        return 'D'
    if scores == 30:
        return 'E'
    else:
        return 'F'

In [46]:
#Test the function
print (mark_list(30))

E

In [47]:
# Apply the function to the Dataframe
df_scores.applymap(mark_list)

        Mathematics Chemistry
depu              E         B
jaison            D         C
sudeesh           C         D
shafeek           B         E
ajmi              A         F

### Data operation with Statistical Functions

In [48]:
#create a dataframe with two test
df_scores = pd.DataFrame({'Test1': [88,89,90,91,92],
                          'Test2': [84,85,86,87,88]},
                         index = ['depu', 'jaison', 'sudeesh', 'shafeek', 'ajmi'] )

In [49]:
#Apply the maximum function to find max score
df_scores.max()

Test1    92
Test2    88
dtype: int64

In [50]:
# Apply mean function to find avg score
df_scores.mean()

Test1    90.0
Test2    86.0
dtype: float64

In [51]:
#Apply standard deviation
df_scores.std()

Test1    1.581139
Test2    1.581139
dtype: float64

### Data operation using Groupby

In [52]:
# Create a dataframe with first and last name
df_names = pd.DataFrame({'first': ['Deepu', 'Jaison', 'Sudheesh', 'Shafeek','Jaison'],
                       'last': ['C', 'Jacob', ' V S', 'P M','J']})

In [53]:
df_names

      first   last
0     Deepu      C
1    Jaison  Jacob
2  Sudheesh    V S
3   Shafeek    P M
4    Jaison      J

In [54]:
# Group the dataframe with first name
grouped = df_names.groupby('first')

In [55]:
#Display the dataframe with first name
grp_data = grouped.get_group('Jaison')
grp_data

    first   last
1  Jaison  Jacob
4  Jaison      J

### Data Operation Using Sorting

In [56]:
#sort thse values in ascending order
df_names.sort_values('first')

      first   last
0     Deepu      C
1    Jaison  Jacob
4    Jaison      J
3   Shafeek    P M
2  Sudheesh    V S

### Data Input and Output

In [57]:
import numpy as np
import pandas as pd

In [58]:
pwd

'/home/icfoss/Downloads/pandas and seaborn/Pandas'

In [59]:
df = pd.read_csv('mtcars.csv')

In [60]:
df.head()

,Unnamed: 0,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [61]:
df1 = pd.read_csv('/home/icfoss/Downloads/pandas and seaborn/Pandas/mtcars.csv')

In [62]:
df1.head()

,Unnamed: 0,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [63]:
# Excel
!pip install xlrd

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: xlrd in /home/icfoss/.local/lib/python3.6/site-packages (2.0.1)

In [64]:
import xlrd
df2 = pd.read_excel('Sample-Sales-Data.xlsx',sheetname='Sheet1')
print(df2)

TypeError: read_excel() got an unexpected keyword argument `sheetname`

In [ ]:
# HTML installing packages 
!pip3 install lxml
#!pip install html5lib
#!pip install BeautifulSoup4

In [ ]:
# HTML input
df3 = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [ ]:
# json data
data = pd.read_json('datajs.json')
print(data)

## Worksheet

 Analyze the Federal Aviation Authority (FAA) dataset using Pandas to do the following:

1. View

    aircraft make name,
    state name,
    aircraft model name,
    text information,
    flight phase,
    event description type,
    fatal flag

2. Clean the dataset and replace the fatal flag NaN with “No”

3. Find the aircraft types and their occurrences in the dataset

4. Remove all the observations where aircraft names are not available

5. Display the observations where fatal flag is “Yes”

#### 1: VIew and import the dataset

In [92]:
#Import necessary libraries
import pandas as pd
import numpy as np

In [93]:
#Import the FAA (Federal Aviation Authority) dataset
data = pd.read_csv("faa_ai_prelim.csv")

#### 2: View and understand the dataset

In [94]:
#View the dataset shape
data.shape

(83, 42)

In [95]:
#View the first five observations
data.head()

,UPDATED,ENTRY_DATE,EVENT_LCL_DATE,EVENT_LCL_TIME,LOC_CITY_NAME,LOC_STATE_NAME,LOC_CNTRY_NAME,RMK_TEXT,EVENT_TYPE_DESC,FSDO_DESC,...,PAX_INJ_NONE,PAX_INJ_MINOR,PAX_INJ_SERIOUS,PAX_INJ_FATAL,PAX_INJ_UNK,GRND_INJ_NONE,GRND_INJ_MINOR,GRND_INJ_SERIOUS,GRND_INJ_FATAL,GRND_INJ_UNK
0,No,19-FEB-16,19-FEB-16,00:45:00Z,MARSHVILLE,North Carolina,NaN,"AIRCRAFT CRASHED INTO TREES, THE 1 PERSON ON B...",Accident,FAA Charlotte FSDO-68,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,No,19-FEB-16,18-FEB-16,23:55:00Z,TAVERNIER,Florida,NaN,AIRCRAFT ON LANDING WENT OFF THE END OF THE RU...,Incident,FAA Miami FSDO-19,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,No,19-FEB-16,18-FEB-16,22:14:00Z,TRENTON,New Jersey,NaN,"AIRCRAFT ON FINAL SUSTAINED A BIRD STRIKE, LAN...",Incident,FAA Philadelphia FSDO-17,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,No,19-FEB-16,18-FEB-16,17:10:00Z,ASHEVILLE,North Carolina,NaN,"AIRCRAFT ON LANDING, GEAR COLLAPSED, ASHEVILLE...",Incident,FAA Charlotte FSDO-68,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,No,19-FEB-16,18-FEB-16,00:26:00Z,TALKEETNA,Alaska,NaN,"AIRCRAFT ON LANDING, NOSE GEAR COLLAPSED, TALK...",Incident,FAA Anchorage FSDO-03,...,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [96]:
#View all the columns present in the dataset
data.columns

Index(['UPDATED', 'ENTRY_DATE', 'EVENT_LCL_DATE', 'EVENT_LCL_TIME',
       'LOC_CITY_NAME', 'LOC_STATE_NAME', 'LOC_CNTRY_NAME', 'RMK_TEXT',
       'EVENT_TYPE_DESC', 'FSDO_DESC', 'REGIST_NBR', 'FLT_NBR', 'ACFT_OPRTR',
       'ACFT_MAKE_NAME', 'ACFT_MODEL_NAME', 'ACFT_MISSING_FLAG',
       'ACFT_DMG_DESC', 'FLT_ACTIVITY', 'FLT_PHASE', 'FAR_PART', 'MAX_INJ_LVL',
       'FATAL_FLAG', 'FLT_CRW_INJ_NONE', 'FLT_CRW_INJ_MINOR',
       'FLT_CRW_INJ_SERIOUS', 'FLT_CRW_INJ_FATAL', 'FLT_CRW_INJ_UNK',
       'CBN_CRW_INJ_NONE', 'CBN_CRW_INJ_MINOR', 'CBN_CRW_INJ_SERIOUS',
       'CBN_CRW_INJ_FATAL', 'CBN_CRW_INJ_UNK', 'PAX_INJ_NONE', 'PAX_INJ_MINOR',
       'PAX_INJ_SERIOUS', 'PAX_INJ_FATAL', 'PAX_INJ_UNK', 'GRND_INJ_NONE',
       'GRND_INJ_MINOR', 'GRND_INJ_SERIOUS', 'GRND_INJ_FATAL', 'GRND_INJ_UNK'],
      dtype='object')

#### 3: Extract the following attributes from the dataset:
1. Aircraft make name
2. State name
3. Aircraft model name
4. Text information
5. Flight phase
6. Event description type
7. Fatal flag

In [97]:
#Create a new dataframe with only the required columns
df = data[['ACFT_MAKE_NAME','LOC_STATE_NAME','ACFT_MODEL_NAME', 'RMK_TEXT','FLT_PHASE',
          'EVENT_TYPE_DESC','FATAL_FLAG']]

In [98]:
#View the type of the object
type(df)

pandas.core.frame.DataFrame

In [99]:
#Check if the dataframe contains all the required attributes
df.head()

,ACFT_MAKE_NAME,LOC_STATE_NAME,ACFT_MODEL_NAME,RMK_TEXT,FLT_PHASE,EVENT_TYPE_DESC,FATAL_FLAG
0,BEECH,North Carolina,36,"AIRCRAFT CRASHED INTO TREES, THE 1 PERSON ON B...",UNKNOWN (UNK),Accident,Yes
1,VANS,Florida,RV7,AIRCRAFT ON LANDING WENT OFF THE END OF THE RU...,LANDING (LDG),Incident,NaN
2,CESSNA,New Jersey,172,"AIRCRAFT ON FINAL SUSTAINED A BIRD STRIKE, LAN...",APPROACH (APR),Incident,NaN
3,LANCAIR,North Carolina,235,"AIRCRAFT ON LANDING, GEAR COLLAPSED, ASHEVILLE...",LANDING (LDG),Incident,NaN
4,CESSNA,Alaska,172,"AIRCRAFT ON LANDING, NOSE GEAR COLLAPSED, TALK...",LANDING (LDG),Incident,NaN

#### 4. Clean the dataset and replace the fatal flag NaN with “No”

In [100]:
df['FATAL_FLAG'].fillna(value = 'No', inplace=True)

In [102]:
df.head()

,ACFT_MAKE_NAME,LOC_STATE_NAME,ACFT_MODEL_NAME,RMK_TEXT,FLT_PHASE,EVENT_TYPE_DESC,FATAL_FLAG
0,BEECH,North Carolina,36,"AIRCRAFT CRASHED INTO TREES, THE 1 PERSON ON B...",UNKNOWN (UNK),Accident,Yes
1,VANS,Florida,RV7,AIRCRAFT ON LANDING WENT OFF THE END OF THE RU...,LANDING (LDG),Incident,No
2,CESSNA,New Jersey,172,"AIRCRAFT ON FINAL SUSTAINED A BIRD STRIKE, LAN...",APPROACH (APR),Incident,No
3,LANCAIR,North Carolina,235,"AIRCRAFT ON LANDING, GEAR COLLAPSED, ASHEVILLE...",LANDING (LDG),Incident,No
4,CESSNA,Alaska,172,"AIRCRAFT ON LANDING, NOSE GEAR COLLAPSED, TALK...",LANDING (LDG),Incident,No

In [103]:
#analyse the shape of dataframe
df.shape

(83, 7)

#### 5. Remove all the observations where aircraft names are not available

In [104]:
#Drop the unwanted values/observations from the dataset
new_df = df.dropna(subset=['ACFT_MAKE_NAME'])

In [105]:
#Check the number of observations now to compare it with the original dataset and see how many values have been dropped
new_df.shape

(78, 7)

#### 6. Find the aircraft types and their occurrences in the dataset

In [111]:
#Group the dataset by aircraft name
aircraft_type = new_df.groupby('ACFT_MAKE_NAME')

In [114]:
#View the number of times each aircraft type appears in the dataset (Hint: use the size() method)
aircraft_type.size()

ACFT_MAKE_NAME
AERO COMMANDER             1
AERONCA                    1
AEROSTAR INTERNATIONAL     1
AIRBUS                     1
BEECH                      9
BELL                       2
BOEING                     3
CESSNA                    23
CHAMPION                   2
CHRISTEN                   1
CONSOLIDATED VULTEE        1
EMBRAER                    1
ENSTROM                    1
FAIRCHILD                  1
FLIGHT DESIGN              1
GLOBE                      1
GREAT LAKES                1
GRUMMAN                    1
GULFSTREAM                 1
HUGHES                     1
LANCAIR                    2
MAULE                      1
MOONEY                     4
NORTH AMERICAN             1
PIPER                     10
PITTS                      1
SAAB                       1
SABRELINER                 1
SOCATA                     2
VANS                       1
dtype: int64

#### 7: Display the observations where fatal flag is “Yes”

In [116]:
#Group the dataset by fatal flag
fatal_accidents = new_df.groupby('FATAL_FLAG')

In [117]:
#View the total number of fatal and non-fatal accidents
fatal_accidents.size()

FATAL_FLAG
No     71
Yes     7
dtype: int64

In [118]:
#Create a new dataframe to view only the fatal accidents (Fatal Flag values = Yes)
accident_with_fatality = fatal_accidents.get_group('Yes')

In [119]:
#view the accidents with fatality
accident_with_fatality

,ACFT_MAKE_NAME,LOC_STATE_NAME,ACFT_MODEL_NAME,RMK_TEXT,FLT_PHASE,EVENT_TYPE_DESC,FATAL_FLAG
0,BEECH,North Carolina,36,"AIRCRAFT CRASHED INTO TREES, THE 1 PERSON ON B...",UNKNOWN (UNK),Accident,Yes
53,PIPER,Florida,PA28,AIRCRAFT CRASHED UNDER UNKNOWN CIRCUMSTANCES. ...,UNKNOWN (UNK),Accident,Yes
55,FLIGHT DESIGN,California,CTLS,AIRCRAFT CRASHED UNDER UNKNOWN CIRCUMSTANCES A...,UNKNOWN (UNK),Accident,Yes
79,NORTH AMERICAN,Arizona,F51,"AIRCRAFT CRASHED UNDER UNKNOWN CIRCUMSTANCES, ...",UNKNOWN (UNK),Accident,Yes
80,CHAMPION,California,8KCAB,"N9872R, BEECH M35 AIRCRAFT, AND N5057G, BELLAN...",UNKNOWN (UNK),Accident,Yes
81,BEECH,California,35,"N9872R, BEECH M35 AIRCRAFT, AND N5057G, BELLAN...",UNKNOWN (UNK),Accident,Yes
82,CESSNA,Alabama,182,N784CP AIRCRAFT CRASHED INTO A WOODED AREA NEA...,UNKNOWN (UNK),Accident,Yes